# Terraform - production
### Terraform Format and Style 🖌 `success`
### Terraform Initialization ⚙️ `success`
### Terraform Validation 🤖 `success`
### Terraform Plan 📖 `success`
<details><summary>Show Plan</summary>
```terraform

Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

The remote workspace is configured to work with configuration at
./src/shared/terraform/workspaces/production relative to the target repository.

Terraform will upload the contents of the following directory,
excluding files or directories as defined by a .terraformignore file
at /home/runner/work/Connectilly/Connectilly/.terraformignore (if it is present),
in order to capture the filesystem context the remote workspace expects:
    /home/runner/work/Connectilly/Connectilly

To view this run in a browser, visit:
https://app.terraform.io/app/connectilly/production/runs/run-MmtK5ywTUBtWpQDb

Waiting for the plan to start...

Terraform v1.4.6
on linux_amd64
Initializing plugins and modules...
module.common.module.identity.tfe_variable.identity_api_upstash_api_key: Refreshing state... [id=var-qRqxrodhmb9e3Uas]
module.common.tfe_project.default: Refreshing state... [id=prj-rsNB7hm66azSZzAh]
module.common.module.organization.tfe_variable.organization_api_upstash_api_key: Refreshing state... [id=var-qYRrNdYY2PJQkadM]
module.common.module.organization.tfe_variable.organization_aws_secret_access_key: Refreshing state... [id=var-KsqBya4E4iK4ixpx]
module.common.module.organization.tfe_variable.organization_upstash_api_key: Refreshing state... [id=var-xxSA1vKtVu39oaFh]
module.common.module.organization.tfe_variable.organization_cockroach_api_key: Refreshing state... [id=var-vkKRizbmkLVbXr4J]
module.common.module.organization.tfe_workspace.organization: Refreshing state... [id=ws-B7cGash46JPvJZht]
module.common.module.organization.tfe_workspace.organization_api: Refreshing state... [id=ws-FVXR3dHVznVoxAio]
module.common.module.identity.tfe_variable.identity_api_aws_secret_access_key: Refreshing state... [id=var-cf41zYfMdeTsGp9k]
module.common.module.customer.tfe_workspace.customer: Refreshing state... [id=ws-v8TSQRyDY42kxSJ9]
module.common.module.organization.tfe_variable.organization_api_aws_secret_access_key: Refreshing state... [id=var-wh3hotWzGBt7abvy]
module.common.module.customer.tfe_variable.customer_api_cockroach_api_key: Refreshing state... [id=var-BsFfUYY4iUdN6naH]
module.common.module.identity.tfe_variable.identity_upstash_api_key: Refreshing state... [id=var-XL57meUHCsUQwREk]
module.common.module.organization.tfe_variable.organization_api_aws_access_key_id: Refreshing state... [id=var-1RBXojbRDbbzz9Hv]
module.common.module.customer.tfe_variable.customer_api_upstash_api_key: Refreshing state... [id=var-f1wSAX8363pzV6sJ]
module.common.module.customer.tfe_workspace.customer_api: Refreshing state... [id=ws-BB6htFBQerSMmsL6]
module.common.module.customer.tfe_variable.customer_api_aws_secret_access_key: Refreshing state... [id=var-Qpw5ErcKvLLBqnhu]
module.common.module.shared.tfe_variable.shared_aws_secret_access_key: Refreshing state... [id=var-Jf5YMbG7ZH33N7Qt]
module.common.module.customer.tfe_variable.customer_upstash_api_key: Refreshing state... [id=var-wnZWJHrtVwrqEEtb]
module.common.module.identity.tfe_variable.identity_aws_access_key_id: Refreshing state... [id=var-aWuA87ZgETCgEyzk]
module.common.module.identity.tfe_variable.identity_api_cockroach_api_key: Refreshing state... [id=var-QpZJvcM2NfTJoY9b]
module.common.module.customer.tfe_variable.customer_aws_secret_access_key: Refreshing state... [id=var-tp7MQSsVaTbi1sDt]
module.common.module.identity.tfe_workspace.identity_api: Refreshing state... [id=ws-fNb4P7kZ8mdzM2Sy]
module.common.module.organization.tfe_variable.organization_api_cockroach_api_key: Refreshing state... [id=var-QG4xZiUSeicXS8X8]
module.common.module.shared.tfe_workspace.shared: Refreshing state... [id=ws-2JATTy7fibDxaMrQ]
module.common.module.identity.tfe_variable.identity_cockroach_api_key: Refreshing state... [id=var-k6ppwVcr8CtQVpYo]
module.common.module.shared.tfe_variable.shared_upstash_api_key: Refreshing state... [id=var-z7gdwqrS8UFMvdgm]
module.common.module.identity.tfe_variable.identity_api_aws_access_key_id: Refreshing state... [id=var-oDj1TURbn1CkgPfc]
module.common.module.identity.tfe_variable.identity_aws_secret_access_key: Refreshing state... [id=var-es5jnnCsfMi4AGxU]
module.common.module.shared.tfe_variable.shared_cockroach_api_key: Refreshing state... [id=var-HyJyzA4PmLiAx7ja]
module.common.module.customer.tfe_variable.customer_api_aws_access_key_id: Refreshing state... [id=var-TUqdgGvUGSrujkiA]
module.common.module.shared.tfe_variable.shared_aws_access_key_id: Refreshing state... [id=var-2yisgh3WH6z4owK5]
module.common.module.organization.tfe_variable.organization_aws_access_key_id: Refreshing state... [id=var-ux6GSHEDzNRbNnry]
module.common.module.identity.tfe_workspace.identity: Refreshing state... [id=ws-vj8bWtiGewUuqecY]
module.common.module.customer.tfe_variable.customer_aws_access_key_id: Refreshing state... [id=var-VtXLawrXRuRbu3R8]
module.common.module.customer.tfe_variable.customer_cockroach_api_key: Refreshing state... [id=var-pxjXhoUcNsjrKr3d]
module.common_resources.data.tfe_organization.default: Refreshing...
module.common_resources.data.tfe_organization.default: Refresh complete after 1s [id=org-5y3MEgeuSg9nz1bX]
module.common_resources.data.tfe_workspace.default: Refreshing...
module.common_resources.data.tfe_workspace.default: Refresh complete after 0s [id=ws-Xxka2Nnf8tPkC1tn]
module.common_resources.data.tfe_variables.default: Refreshing...
module.common_resources.data.tfe_variables.default: Refresh complete after 0s [id=variables/ws-Xxka2Nnf8tPkC1tn]
module.common.module.customer.tfe_workspace.customer_api: Drift detected (update)
module.common.module.customer.tfe_workspace.customer: Drift detected (update)
module.common.module.identity.tfe_workspace.identity: Drift detected (update)
module.common.module.identity.tfe_workspace.identity_api: Drift detected (update)
module.common.module.organization.tfe_workspace.organization_api: Drift detected (update)
module.common.module.organization.tfe_workspace.organization: Drift detected (update)
module.common.module.shared.tfe_workspace.shared: Drift detected (update)

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # module.common.tfe_project.default will be destroyed
  # (because tfe_project.default is not in configuration)
  - resource "tfe_project" "default" {
      - id           = "prj-rsNB7hm66azSZzAh" -> null
      - name         = "production" -> null
      - organization = "connectilly" -> null
    }

  # module.common_resources.tfe_project.default will be created
  + resource "tfe_project" "default" {
      + id           = (known after apply)
      + name         = "production"
      + organization = "connectilly"
    }

  # module.common.module.customer.tfe_variable.customer_api_aws_access_key_id will be destroyed
  # (because tfe_variable.customer_api_aws_access_key_id is not in configuration)
  - resource "tfe_variable" "customer_api_aws_access_key_id" {
      - category     = "env" -> null
      - hcl          = false -> null
      - id           = "var-TUqdgGvUGSrujkiA" -> null
      - key          = "AWS_ACCESS_KEY_ID" -> null
      - sensitive    = true -> null
      - value        = (sensitive value) -> null
      - workspace_id = "ws-BB6htFBQerSMmsL6" -> null
    }

  # module.common.module.customer.tfe_variable.customer_api_aws_secret_access_key will be destroyed
  # (because tfe_variable.customer_api_aws_secret_access_key is not in configuration)
  - resource "tfe_variable" "customer_api_aws_secret_access_key" {
      - category     = "env" -> null
      - hcl          = false -> null
      - id           = "var-Qpw5ErcKvLLBqnhu" -> null
      - key          = "AWS_SECRET_ACCESS_KEY" -> null
      - sensitive    = true -> null
      - value        = (sensitive value) -> null
      - workspace_id = "ws-BB6htFBQerSMmsL6" -> null
    }

  # module.common.module.customer.tfe_variable.customer_api_cockroach_api_key will be destroyed
  # (because tfe_variable.customer_api_cockroach_api_key is not in configuration)
  - resource "tfe_variable" "customer_api_cockroach_api_key" {
      - category     = "env" -> null
      - hcl          = false -> null
      - id           = "var-BsFfUYY4iUdN6naH" -> null
      - key          = "COCKROACH_API_KEY" -> null
      - sensitive    = true -> null
      - value        = (sensitive value) -> null
      - workspace_id = "ws-BB6htFBQerSMmsL6" -> null
    }

  # module.common.module.customer.tfe_variable.customer_api_upstash_api_key will be destroyed
  # (because tfe_variable.customer_api_upstash_api_key is not in configuration)
  - resource "tfe_variable" "customer_api_upstash_api_key" {
      - category     = "env" -> null
      - hcl          = false -> null
      - id           = "var-f1wSAX8363pzV6sJ" -> null
      - key          = "TF_VAR_UPSTASH_API_KEY" -> null
      - sensitive    = true -> null
      - value        = (sensitive value) -> null
      - workspace_id = "ws-BB6htFBQerSMmsL6" -> null
    }

  # module.common.module.customer.tfe_variable.customer_aws_access_key_id will be destroyed
  # (because tfe_variable.customer_aws_access_key_id is not in configuration)
  - resource "tfe_variable" "customer_aws_access_key_id" {
      - category     = "env" -> null
      - hcl          = false -> null
      - id           = "var-VtXLawrXRuRbu3R8" -> null
      - key          = "AWS_ACCESS_KEY_ID" -> null
      - sensitive    = true -> null
      - value        = (sensitive value) -> null
      - workspace_id = "ws-v8TSQRyDY42kxSJ9" -> null
    }

  # module.common.module.customer.tfe_variable.customer_aws_secret_access_key will be destroyed
  # (because tfe_variable.customer_aws_secret_access_key is not in configuration)
  - resource "tfe_variable" "customer_aws_secret_access_key" {
      - category     = "env" -> null
      - hcl          = false -> null
      - id           = "var-tp7MQSsVaTbi1sDt" -> null
      - key          = "AWS_SECRET_ACCESS_KEY" -> null
      - sensitive    = true -> null
      - value        = (sensitive value) -> null
      - workspace_id = "ws-v8TSQRyDY42kxSJ9" -> null
    }

  # module.common.module.customer.tfe_variable.customer_cockroach_api_key will be destroyed
  # (because tfe_variable.customer_cockroach_api_key is not in configuration)
  - resource "tfe_variable" "customer_cockroach_api_key" {
      - category     = "env" -> null
      - hcl          = false -> null
      - id           = "var-pxjXhoUcNsjrKr3d" -> null
      - key          = "COCKROACH_API_KEY" -> null
      - sensitive    = true -> null
      - value        = (sensitive value) -> null
      - workspace_id = "ws-v8TSQRyDY42kxSJ9" -> null
    }

  # module.common.module.customer.tfe_variable.customer_upstash_api_key will be destroyed
  # (because tfe_variable.customer_upstash_api_key is not in configuration)
  - resource "tfe_variable" "customer_upstash_api_key" {
      - category     = "env" -> null
      - hcl          = false -> null
      - id           = "var-wnZWJHrtVwrqEEtb" -> null
      - key          = "TF_VAR_UPSTASH_API_KEY" -> null
      - sensitive    = true -> null
      - value        = (sensitive value) -> null
      - workspace_id = "ws-v8TSQRyDY42kxSJ9" -> null
    }

  # module.common.module.customer.tfe_workspace.customer will be destroyed
  # (because tfe_workspace.customer is not in configuration)
  - resource "tfe_workspace" "customer" {
      - allow_destroy_plan            = true -> null
      - assessments_enabled           = false -> null
      - auto_apply                    = false -> null
      - execution_mode                = "local" -> null
      - file_triggers_enabled         = true -> null
      - force_delete                  = true -> null
      - global_remote_state           = false -> null
      - html_url                      = "https://app.terraform.io/app/connectilly/workspaces/production-customer" -> null
      - id                            = "ws-v8TSQRyDY42kxSJ9" -> null
      - name                          = "production-customer" -> null
      - operations                    = false -> null
      - organization                  = "connectilly" -> null
      - project_id                    = "prj-rsNB7hm66azSZzAh" -> null
      - queue_all_runs                = true -> null
      - remote_state_consumer_ids     = [] -> null
      - resource_count                = 8 -> null
      - speculative_enabled           = true -> null
      - structured_run_output_enabled = true -> null
      - tag_names                     = [
          - "customer",
          - "production",
        ] -> null
      - terraform_version             = "1.4.6" -> null
      - trigger_patterns              = [] -> null
      - trigger_prefixes              = [] -> null
    }

  # module.common.module.customer.tfe_workspace.customer_api will be destroyed
  # (because tfe_workspace.customer_api is not in configuration)
  - resource "tfe_workspace" "customer_api" {
      - allow_destroy_plan            = true -> null
      - assessments_enabled           = false -> null
      - auto_apply                    = false -> null
      - execution_mode                = "local" -> null
      - file_triggers_enabled         = true -> null
      - force_delete                  = true -> null
      - global_remote_state           = false -> null
      - html_url                      = "https://app.terraform.io/app/connectilly/workspaces/production-customer-api" -> null
      - id                            = "ws-BB6htFBQerSMmsL6" -> null
      - name                          = "production-customer-api" -> null
      - operations                    = false -> null
      - organization                  = "connectilly" -> null
      - project_id                    = "prj-rsNB7hm66azSZzAh" -> null
      - queue_all_runs                = true -> null
      - remote_state_consumer_ids     = [] -> null
      - resource_count                = 19 -> null
      - speculative_enabled           = true -> null
      - structured_run_output_enabled = true -> null
      - tag_names                     = [
          - "api",
          - "customer",
          - "production",
        ] -> null
      - terraform_version             = "1.4.6" -> null
      - trigger_patterns              = [] -> null
      - trigger_prefixes              = [] -> null
    }

  # module.common.module.identity.tfe_variable.identity_api_aws_access_key_id will be destroyed
  # (because tfe_variable.identity_api_aws_access_key_id is not in configuration)
  - resource "tfe_variable" "identity_api_aws_access_key_id" {
      - category     = "env" -> null
      - hcl          = false -> null
      - id           = "var-oDj1TURbn1CkgPfc" -> null
      - key          = "AWS_ACCESS_KEY_ID" -> null
      - sensitive    = true -> null
      - value        = (sensitive value) -> null
      - workspace_id = "ws-fNb4P7kZ8mdzM2Sy" -> null
    }

  # module.common.module.identity.tfe_variable.identity_api_aws_secret_access_key will be destroyed
  # (because tfe_variable.identity_api_aws_secret_access_key is not in configuration)
  - resource "tfe_variable" "identity_api_aws_secret_access_key" {
      - category     = "env" -> null
      - hcl          = false -> null
      - id           = "var-cf41zYfMdeTsGp9k" -> null
      - key          = "AWS_SECRET_ACCESS_KEY" -> null
      - sensitive    = true -> null
      - value        = (sensitive value) -> null
      - workspace_id = "ws-fNb4P7kZ8mdzM2Sy" -> null
    }

  # module.common.module.identity.tfe_variable.identity_api_cockroach_api_key will be destroyed
  # (because tfe_variable.identity_api_cockroach_api_key is not in configuration)
  - resource "tfe_variable" "identity_api_cockroach_api_key" {
      - category     = "env" -> null
      - hcl          = false -> null
      - id           = "var-QpZJvcM2NfTJoY9b" -> null
      - key          = "COCKROACH_API_KEY" -> null
      - sensitive    = true -> null
      - value        = (sensitive value) -> null
      - workspace_id = "ws-fNb4P7kZ8mdzM2Sy" -> null
    }

  # module.common.module.identity.tfe_variable.identity_api_upstash_api_key will be destroyed
  # (because tfe_variable.identity_api_upstash_api_key is not in configuration)
  - resource "tfe_variable" "identity_api_upstash_api_key" {
      - category     = "env" -> null
      - hcl          = false -> null
      - id           = "var-qRqxrodhmb9e3Uas" -> null
      - key          = "TF_VAR_UPSTASH_API_KEY" -> null
      - sensitive    = true -> null
      - value        = (sensitive value) -> null
      - workspace_id = "ws-fNb4P7kZ8mdzM2Sy" -> null
    }

  # module.common.module.identity.tfe_variable.identity_aws_access_key_id will be destroyed
  # (because tfe_variable.identity_aws_access_key_id is not in configuration)
  - resource "tfe_variable" "identity_aws_access_key_id" {
      - category     = "env" -> null
      - hcl          = false -> null
      - id           = "var-aWuA87ZgETCgEyzk" -> null
      - key          = "AWS_ACCESS_KEY_ID" -> null
      - sensitive    = true -> null
      - value        = (sensitive value) -> null
      - workspace_id = "ws-vj8bWtiGewUuqecY" -> null
    }

  # module.common.module.identity.tfe_variable.identity_aws_secret_access_key will be destroyed
  # (because tfe_variable.identity_aws_secret_access_key is not in configuration)
  - resource "tfe_variable" "identity_aws_secret_access_key" {
      - category     = "env" -> null
      - hcl          = false -> null
      - id           = "var-es5jnnCsfMi4AGxU" -> null
      - key          = "AWS_SECRET_ACCESS_KEY" -> null
      - sensitive    = true -> null
      - value        = (sensitive value) -> null
      - workspace_id = "ws-vj8bWtiGewUuqecY" -> null
    }

  # module.common.module.identity.tfe_variable.identity_cockroach_api_key will be destroyed
  # (because tfe_variable.identity_cockroach_api_key is not in configuration)
  - resource "tfe_variable" "identity_cockroach_api_key" {
      - category     = "env" -> null
      - hcl          = false -> null
      - id           = "var-k6ppwVcr8CtQVpYo" -> null
      - key          = "COCKROACH_API_KEY" -> null
      - sensitive    = true -> null
      - value        = (sensitive value) -> null
      - workspace_id = "ws-vj8bWtiGewUuqecY" -> null
    }

  # module.common.module.identity.tfe_variable.identity_upstash_api_key will be destroyed
  # (because tfe_variable.identity_upstash_api_key is not in configuration)
  - resource "tfe_variable" "identity_upstash_api_key" {
      - category     = "env" -> null
      - hcl          = false -> null
      - id           = "var-XL57meUHCsUQwREk" -> null
      - key          = "TF_VAR_UPSTASH_API_KEY" -> null
      - sensitive    = true -> null
      - value        = (sensitive value) -> null
      - workspace_id = "ws-vj8bWtiGewUuqecY" -> null
    }

  # module.common.module.identity.tfe_workspace.identity will be destroyed
  # (because tfe_workspace.identity is not in configuration)
  - resource "tfe_workspace" "identity" {
      - allow_destroy_plan            = true -> null
      - assessments_enabled           = false -> null
      - auto_apply                    = false -> null
      - execution_mode                = "local" -> null
      - file_triggers_enabled         = true -> null
      - force_delete                  = true -> null
      - global_remote_state           = false -> null
      - html_url                      = "https://app.terraform.io/app/connectilly/workspaces/production-identity" -> null
      - id                            = "ws-vj8bWtiGewUuqecY" -> null
      - name                          = "production-identity" -> null
      - operations                    = false -> null
      - organization                  = "connectilly" -> null
      - project_id                    = "prj-rsNB7hm66azSZzAh" -> null
      - queue_all_runs                = true -> null
      - remote_state_consumer_ids     = [] -> null
      - resource_count                = 8 -> null
      - speculative_enabled           = true -> null
      - structured_run_output_enabled = true -> null
      - tag_names                     = [
          - "identity",
          - "production",
        ] -> null
      - terraform_version             = "1.4.6" -> null
      - trigger_patterns              = [] -> null
      - trigger_prefixes              = [] -> null
    }

  # module.common.module.identity.tfe_workspace.identity_api will be destroyed
  # (because tfe_workspace.identity_api is not in configuration)
  - resource "tfe_workspace" "identity_api" {
      - allow_destroy_plan            = true -> null
      - assessments_enabled           = false -> null
      - auto_apply                    = false -> null
      - execution_mode                = "local" -> null
      - file_triggers_enabled         = true -> null
      - force_delete                  = true -> null
      - global_remote_state           = false -> null
      - html_url                      = "https://app.terraform.io/app/connectilly/workspaces/production-identity-api" -> null
      - id                            = "ws-fNb4P7kZ8mdzM2Sy" -> null
      - name                          = "production-identity-api" -> null
      - operations                    = false -> null
      - organization                  = "connectilly" -> null
      - project_id                    = "prj-rsNB7hm66azSZzAh" -> null
      - queue_all_runs                = true -> null
      - remote_state_consumer_ids     = [] -> null
      - resource_count                = 19 -> null
      - speculative_enabled           = true -> null
      - structured_run_output_enabled = true -> null
      - tag_names                     = [
          - "api",
          - "identity",
          - "production",
        ] -> null
      - terraform_version             = "1.4.6" -> null
      - trigger_patterns              = [] -> null
      - trigger_prefixes              = [] -> null
    }

  # module.common.module.organization.tfe_variable.organization_api_aws_access_key_id will be destroyed
  # (because tfe_variable.organization_api_aws_access_key_id is not in configuration)
  - resource "tfe_variable" "organization_api_aws_access_key_id" {
      - category     = "env" -> null
      - hcl          = false -> null
      - id           = "var-1RBXojbRDbbzz9Hv" -> null
      - key          = "AWS_ACCESS_KEY_ID" -> null
      - sensitive    = true -> null
      - value        = (sensitive value) -> null
      - workspace_id = "ws-FVXR3dHVznVoxAio" -> null
    }

  # module.common.module.organization.tfe_variable.organization_api_aws_secret_access_key will be destroyed
  # (because tfe_variable.organization_api_aws_secret_access_key is not in configuration)
  - resource "tfe_variable" "organization_api_aws_secret_access_key" {
      - category     = "env" -> null
      - hcl          = false -> null
      - id           = "var-wh3hotWzGBt7abvy" -> null
      - key          = "AWS_SECRET_ACCESS_KEY" -> null
      - sensitive    = true -> null
      - value        = (sensitive value) -> null
      - workspace_id = "ws-FVXR3dHVznVoxAio" -> null
    }

  # module.common.module.organization.tfe_variable.organization_api_cockroach_api_key will be destroyed
  # (because tfe_variable.organization_api_cockroach_api_key is not in configuration)
  - resource "tfe_variable" "organization_api_cockroach_api_key" {
      - category     = "env" -> null
      - hcl          = false -> null
      - id           = "var-QG4xZiUSeicXS8X8" -> null
      - key          = "COCKROACH_API_KEY" -> null
      - sensitive    = true -> null
      - value        = (sensitive value) -> null
      - workspace_id = "ws-FVXR3dHVznVoxAio" -> null
    }

  # module.common.module.organization.tfe_variable.organization_api_upstash_api_key will be destroyed
  # (because tfe_variable.organization_api_upstash_api_key is not in configuration)
  - resource "tfe_variable" "organization_api_upstash_api_key" {
      - category     = "env" -> null
      - hcl          = false -> null
      - id           = "var-qYRrNdYY2PJQkadM" -> null
      - key          = "TF_VAR_UPSTASH_API_KEY" -> null
      - sensitive    = true -> null
      - value        = (sensitive value) -> null
      - workspace_id = "ws-FVXR3dHVznVoxAio" -> null
    }

  # module.common.module.organization.tfe_variable.organization_aws_access_key_id will be destroyed
  # (because tfe_variable.organization_aws_access_key_id is not in configuration)
  - resource "tfe_variable" "organization_aws_access_key_id" {
      - category     = "env" -> null
      - hcl          = false -> null
      - id           = "var-ux6GSHEDzNRbNnry" -> null
      - key          = "AWS_ACCESS_KEY_ID" -> null
      - sensitive    = true -> null
      - value        = (sensitive value) -> null
      - workspace_id = "ws-B7cGash46JPvJZht" -> null
    }

  # module.common.module.organization.tfe_variable.organization_aws_secret_access_key will be destroyed
  # (because tfe_variable.organization_aws_secret_access_key is not in configuration)
  - resource "tfe_variable" "organization_aws_secret_access_key" {
      - category     = "env" -> null
      - hcl          = false -> null
      - id           = "var-KsqBya4E4iK4ixpx" -> null
      - key          = "AWS_SECRET_ACCESS_KEY" -> null
      - sensitive    = true -> null
      - value        = (sensitive value) -> null
      - workspace_id = "ws-B7cGash46JPvJZht" -> null
    }

  # module.common.module.organization.tfe_variable.organization_cockroach_api_key will be destroyed
  # (because tfe_variable.organization_cockroach_api_key is not in configuration)
  - resource "tfe_variable" "organization_cockroach_api_key" {
      - category     = "env" -> null
      - hcl          = false -> null
      - id           = "var-vkKRizbmkLVbXr4J" -> null
      - key          = "COCKROACH_API_KEY" -> null
      - sensitive    = true -> null
      - value        = (sensitive value) -> null
      - workspace_id = "ws-B7cGash46JPvJZht" -> null
    }

  # module.common.module.organization.tfe_variable.organization_upstash_api_key will be destroyed
  # (because tfe_variable.organization_upstash_api_key is not in configuration)
  - resource "tfe_variable" "organization_upstash_api_key" {
      - category     = "env" -> null
      - hcl          = false -> null
      - id           = "var-xxSA1vKtVu39oaFh" -> null
      - key          = "TF_VAR_UPSTASH_API_KEY" -> null
      - sensitive    = true -> null
      - value        = (sensitive value) -> null
      - workspace_id = "ws-B7cGash46JPvJZht" -> null
    }

  # module.common.module.organization.tfe_workspace.organization will be destroyed
  # (because tfe_workspace.organization is not in configuration)
  - resource "tfe_workspace" "organization" {
      - allow_destroy_plan            = true -> null
      - assessments_enabled           = false -> null
      - auto_apply                    = false -> null
      - execution_mode                = "local" -> null
      - file_triggers_enabled         = true -> null
      - force_delete                  = true -> null
      - global_remote_state           = false -> null
      - html_url                      = "https://app.terraform.io/app/connectilly/workspaces/production-organization" -> null
      - id                            = "ws-B7cGash46JPvJZht" -> null
      - name                          = "production-organization" -> null
      - operations                    = false -> null
      - organization                  = "connectilly" -> null
      - project_id                    = "prj-rsNB7hm66azSZzAh" -> null
      - queue_all_runs                = true -> null
      - remote_state_consumer_ids     = [] -> null
      - resource_count                = 8 -> null
      - speculative_enabled           = true -> null
      - structured_run_output_enabled = true -> null
      - tag_names                     = [
          - "organization",
          - "production",
        ] -> null
      - terraform_version             = "1.4.6" -> null
      - trigger_patterns              = [] -> null
      - trigger_prefixes              = [] -> null
    }

  # module.common.module.organization.tfe_workspace.organization_api will be destroyed
  # (because tfe_workspace.organization_api is not in configuration)
  - resource "tfe_workspace" "organization_api" {
      - allow_destroy_plan            = true -> null
      - assessments_enabled           = false -> null
      - auto_apply                    = false -> null
      - execution_mode                = "local" -> null
      - file_triggers_enabled         = true -> null
      - force_delete                  = true -> null
      - global_remote_state           = false -> null
      - html_url                      = "https://app.terraform.io/app/connectilly/workspaces/production-organization-api" -> null
      - id                            = "ws-FVXR3dHVznVoxAio" -> null
      - name                          = "production-organization-api" -> null
      - operations                    = false -> null
      - organization                  = "connectilly" -> null
      - project_id                    = "prj-rsNB7hm66azSZzAh" -> null
      - queue_all_runs                = true -> null
      - remote_state_consumer_ids     = [] -> null
      - resource_count                = 19 -> null
      - speculative_enabled           = true -> null
      - structured_run_output_enabled = true -> null
      - tag_names                     = [
          - "api",
          - "organization",
          - "production",
        ] -> null
      - terraform_version             = "1.4.6" -> null
      - trigger_patterns              = [] -> null
      - trigger_prefixes              = [] -> null
    }

  # module.common.module.shared.tfe_variable.shared_aws_access_key_id will be destroyed
  # (because tfe_variable.shared_aws_access_key_id is not in configuration)
  - resource "tfe_variable" "shared_aws_access_key_id" {
      - category     = "env" -> null
      - hcl          = false -> null
      - id           = "var-2yisgh3WH6z4owK5" -> null
      - key          = "AWS_ACCESS_KEY_ID" -> null
      - sensitive    = true -> null
      - value        = (sensitive value) -> null
      - workspace_id = "ws-2JATTy7fibDxaMrQ" -> null
    }

  # module.common.module.shared.tfe_variable.shared_aws_secret_access_key will be destroyed
  # (because tfe_variable.shared_aws_secret_access_key is not in configuration)
  - resource "tfe_variable" "shared_aws_secret_access_key" {
      - category     = "env" -> null
      - hcl          = false -> null
      - id           = "var-Jf5YMbG7ZH33N7Qt" -> null
      - key          = "AWS_SECRET_ACCESS_KEY" -> null
      - sensitive    = true -> null
      - value        = (sensitive value) -> null
      - workspace_id = "ws-2JATTy7fibDxaMrQ" -> null
    }

  # module.common.module.shared.tfe_variable.shared_cockroach_api_key will be destroyed
  # (because tfe_variable.shared_cockroach_api_key is not in configuration)
  - resource "tfe_variable" "shared_cockroach_api_key" {
      - category     = "env" -> null
      - hcl          = false -> null
      - id           = "var-HyJyzA4PmLiAx7ja" -> null
      - key          = "COCKROACH_API_KEY" -> null
      - sensitive    = true -> null
      - value        = (sensitive value) -> null
      - workspace_id = "ws-2JATTy7fibDxaMrQ" -> null
    }

  # module.common.module.shared.tfe_variable.shared_upstash_api_key will be destroyed
  # (because tfe_variable.shared_upstash_api_key is not in configuration)
  - resource "tfe_variable" "shared_upstash_api_key" {
      - category     = "env" -> null
      - hcl          = false -> null
      - id           = "var-z7gdwqrS8UFMvdgm" -> null
      - key          = "TF_VAR_UPSTASH_API_KEY" -> null
      - sensitive    = true -> null
      - value        = (sensitive value) -> null
      - workspace_id = "ws-2JATTy7fibDxaMrQ" -> null
    }

  # module.common.module.shared.tfe_workspace.shared will be destroyed
  # (because tfe_workspace.shared is not in configuration)
  - resource "tfe_workspace" "shared" {
      - allow_destroy_plan            = true -> null
      - assessments_enabled           = false -> null
      - auto_apply                    = false -> null
      - execution_mode                = "local" -> null
      - file_triggers_enabled         = true -> null
      - force_delete                  = true -> null
      - global_remote_state           = false -> null
      - html_url                      = "https://app.terraform.io/app/connectilly/workspaces/production-shared" -> null
      - id                            = "ws-2JATTy7fibDxaMrQ" -> null
      - name                          = "production-shared" -> null
      - operations                    = false -> null
      - organization                  = "connectilly" -> null
      - project_id                    = "prj-rsNB7hm66azSZzAh" -> null
      - queue_all_runs                = true -> null
      - remote_state_consumer_ids     = [] -> null
      - resource_count                = 4 -> null
      - speculative_enabled           = true -> null
      - structured_run_output_enabled = true -> null
      - tag_names                     = [
          - "production",
          - "shared",
        ] -> null
      - terraform_version             = "1.4.6" -> null
      - trigger_patterns              = [] -> null
      - trigger_prefixes              = [] -> null
    }

  # module.common_resources.module.customer.tfe_variable.customer_api_aws_access_key_id will be created
  + resource "tfe_variable" "customer_api_aws_access_key_id" {
      + category     = "env"
      + hcl          = false
      + id           = (known after apply)
      + key          = "AWS_ACCESS_KEY_ID"
      + sensitive    = true
      + value        = (sensitive value)
      + workspace_id = (known after apply)
    }

  # module.common_resources.module.customer.tfe_variable.customer_api_aws_secret_access_key will be created
  + resource "tfe_variable" "customer_api_aws_secret_access_key" {
      + category     = "env"
      + hcl          = false
      + id           = (known after apply)
      + key          = "AWS_SECRET_ACCESS_KEY"
      + sensitive    = true
      + value        = (sensitive value)
      + workspace_id = (known after apply)
    }

  # module.common_resources.module.customer.tfe_variable.customer_api_cockroach_api_key will be created
  + resource "tfe_variable" "customer_api_cockroach_api_key" {
      + category     = "env"
      + hcl          = false
      + id           = (known after apply)
      + key          = "COCKROACH_API_KEY"
      + sensitive    = true
      + value        = (sensitive value)
      + workspace_id = (known after apply)
    }

  # module.common_resources.module.customer.tfe_variable.customer_api_upstash_api_key will be created
  + resource "tfe_variable" "customer_api_upstash_api_key" {
      + category     = "env"
      + hcl          = false
      + id           = (known after apply)
      + key          = "TF_VAR_UPSTASH_API_KEY"
      + sensitive    = true
      + value        = (sensitive value)
      + workspace_id = (known after apply)
    }

  # module.common_resources.module.customer.tfe_variable.customer_aws_access_key_id will be created
  + resource "tfe_variable" "customer_aws_access_key_id" {
      + category     = "env"
      + hcl          = false
      + id           = (known after apply)
      + key          = "AWS_ACCESS_KEY_ID"
      + sensitive    = true
      + value        = (sensitive value)
      + workspace_id = (known after apply)
    }

  # module.common_resources.module.customer.tfe_variable.customer_aws_secret_access_key will be created
  + resource "tfe_variable" "customer_aws_secret_access_key" {
      + category     = "env"
      + hcl          = false
      + id           = (known after apply)
      + key          = "AWS_SECRET_ACCESS_KEY"
      + sensitive    = true
      + value        = (sensitive value)
      + workspace_id = (known after apply)
    }

  # module.common_resources.module.customer.tfe_variable.customer_cockroach_api_key will be created
  + resource "tfe_variable" "customer_cockroach_api_key" {
      + category     = "env"
      + hcl          = false
      + id           = (known after apply)
      + key          = "COCKROACH_API_KEY"
      + sensitive    = true
      + value        = (sensitive value)
      + workspace_id = (known after apply)
    }

  # module.common_resources.module.customer.tfe_variable.customer_upstash_api_key will be created
  + resource "tfe_variable" "customer_upstash_api_key" {
      + category     = "env"
      + hcl          = false
      + id           = (known after apply)
      + key          = "TF_VAR_UPSTASH_API_KEY"
      + sensitive    = true
      + value        = (sensitive value)
      + workspace_id = (known after apply)
    }

  # module.common_resources.module.customer.tfe_workspace.customer will be created
  + resource "tfe_workspace" "customer" {
      + allow_destroy_plan            = true
      + auto_apply                    = false
      + execution_mode                = "local"
      + file_triggers_enabled         = true
      + force_delete                  = true
      + global_remote_state           = (known after apply)
      + html_url                      = (known after apply)
      + id                            = (known after apply)
      + name                          = "production_customer"
      + operations                    = (known after apply)
      + organization                  = "connectilly"
      + project_id                    = (known after apply)
      + queue_all_runs                = true
      + remote_state_consumer_ids     = (known after apply)
      + resource_count                = (known after apply)
      + speculative_enabled           = true
      + structured_run_output_enabled = true
      + tag_names                     = [
          + "customer",
          + "production",
        ]
      + terraform_version             = (known after apply)
      + working_directory             = "./src/customer/shared/infrastructure/workspaces/production"
    }

  # module.common_resources.module.customer.tfe_workspace.customer_api will be created
  + resource "tfe_workspace" "customer_api" {
      + allow_destroy_plan            = true
      + auto_apply                    = false
      + execution_mode                = "local"
      + file_triggers_enabled         = true
      + force_delete                  = true
      + global_remote_state           = (known after apply)
      + html_url                      = (known after apply)
      + id                            = (known after apply)
      + name                          = "production_customer_api"
      + operations                    = (known after apply)
      + organization                  = "connectilly"
      + project_id                    = (known after apply)
      + queue_all_runs                = true
      + remote_state_consumer_ids     = (known after apply)
      + resource_count                = (known after apply)
      + speculative_enabled           = true
      + structured_run_output_enabled = true
      + tag_names                     = [
          + "api",
          + "customer",
          + "production",
        ]
      + terraform_version             = (known after apply)
      + working_directory             = "./src/customer/customer-api/infrastructure/workspaces/production"
    }

  # module.common_resources.module.identity.tfe_variable.identity_api_aws_access_key_id will be created
  + resource "tfe_variable" "identity_api_aws_access_key_id" {
      + category     = "env"
      + hcl          = false
      + id           = (known after apply)
      + key          = "AWS_ACCESS_KEY_ID"
      + sensitive    = true
      + value        = (sensitive value)
      + workspace_id = (known after apply)
    }

  # module.common_resources.module.identity.tfe_variable.identity_api_aws_secret_access_key will be created
  + resource "tfe_variable" "identity_api_aws_secret_access_key" {
      + category     = "env"
      + hcl          = false
      + id           = (known after apply)
      + key          = "AWS_SECRET_ACCESS_KEY"
      + sensitive    = true
      + value        = (sensitive value)
      + workspace_id = (known after apply)
    }

  # module.common_resources.module.identity.tfe_variable.identity_api_cockroach_api_key will be created
  + resource "tfe_variable" "identity_api_cockroach_api_key" {
      + category     = "env"
      + hcl          = false
      + id           = (known after apply)
      + key          = "COCKROACH_API_KEY"
      + sensitive    = true
      + value        = (sensitive value)
      + workspace_id = (known after apply)
    }

  # module.common_resources.module.identity.tfe_variable.identity_api_upstash_api_key will be created
  + resource "tfe_variable" "identity_api_upstash_api_key" {
      + category     = "env"
      + hcl          = false
      + id           = (known after apply)
      + key          = "TF_VAR_UPSTASH_API_KEY"
      + sensitive    = true
      + value        = (sensitive value)
      + workspace_id = (known after apply)
    }

  # module.common_resources.module.identity.tfe_variable.identity_aws_access_key_id will be created
  + resource "tfe_variable" "identity_aws_access_key_id" {
      + category     = "env"
      + hcl          = false
      + id           = (known after apply)
      + key          = "AWS_ACCESS_KEY_ID"
      + sensitive    = true
      + value        = (sensitive value)
      + workspace_id = (known after apply)
    }

  # module.common_resources.module.identity.tfe_variable.identity_aws_secret_access_key will be created
  + resource "tfe_variable" "identity_aws_secret_access_key" {
      + category     = "env"
      + hcl          = false
      + id           = (known after apply)
      + key          = "AWS_SECRET_ACCESS_KEY"
      + sensitive    = true
      + value        = (sensitive value)
      + workspace_id = (known after apply)
    }

  # module.common_resources.module.identity.tfe_variable.identity_cockroach_api_key will be created
  + resource "tfe_variable" "identity_cockroach_api_key" {
      + category     = "env"
      + hcl          = false
      + id           = (known after apply)
      + key          = "COCKROACH_API_KEY"
      + sensitive    = true
      + value        = (sensitive value)
      + workspace_id = (known after apply)
    }

  # module.common_resources.module.identity.tfe_variable.identity_upstash_api_key will be created
  + resource "tfe_variable" "identity_upstash_api_key" {
      + category     = "env"
      + hcl          = false
      + id           = (known after apply)
      + key          = "TF_VAR_UPSTASH_API_KEY"
      + sensitive    = true
      + value        = (sensitive value)
      + workspace_id = (known after apply)
    }

  # module.common_resources.module.identity.tfe_workspace.identity will be created
  + resource "tfe_workspace" "identity" {
      + allow_destroy_plan            = true
      + auto_apply                    = false
      + execution_mode                = "local"
      + file_triggers_enabled         = true
      + force_delete                  = true
      + global_remote_state           = (known after apply)
      + html_url                      = (known after apply)
      + id                            = (known after apply)
      + name                          = "production_identity"
      + operations                    = (known after apply)
      + organization                  = "connectilly"
      + project_id                    = (known after apply)
      + queue_all_runs                = true
      + remote_state_consumer_ids     = (known after apply)
      + resource_count                = (known after apply)
      + speculative_enabled           = true
      + structured_run_output_enabled = true
      + tag_names                     = [
          + "identity",
          + "production",
        ]
      + terraform_version             = (known after apply)
      + working_directory             = "./src/identity/shared/infrastructure/workspaces/production"
    }

  # module.common_resources.module.identity.tfe_workspace.identity_api will be created
  + resource "tfe_workspace" "identity_api" {
      + allow_destroy_plan            = true
      + auto_apply                    = false
      + execution_mode                = "local"
      + file_triggers_enabled         = true
      + force_delete                  = true
      + global_remote_state           = (known after apply)
      + html_url                      = (known after apply)
      + id                            = (known after apply)
      + name                          = "production_identity_api"
      + operations                    = (known after apply)
      + organization                  = "connectilly"
      + project_id                    = (known after apply)
      + queue_all_runs                = true
      + remote_state_consumer_ids     = (known after apply)
      + resource_count                = (known after apply)
      + speculative_enabled           = true
      + structured_run_output_enabled = true
      + tag_names                     = [
          + "api",
          + "identity",
          + "production",
        ]
      + terraform_version             = (known after apply)
      + working_directory             = "./src/identity/identity-api/infrastructure/workspaces/production"
    }

  # module.common_resources.module.organization.tfe_variable.organization_api_aws_access_key_id will be created
  + resource "tfe_variable" "organization_api_aws_access_key_id" {
      + category     = "env"
      + hcl          = false
      + id           = (known after apply)
      + key          = "AWS_ACCESS_KEY_ID"
      + sensitive    = true
      + value        = (sensitive value)
      + workspace_id = (known after apply)
    }

  # module.common_resources.module.organization.tfe_variable.organization_api_aws_secret_access_key will be created
  + resource "tfe_variable" "organization_api_aws_secret_access_key" {
      + category     = "env"
      + hcl          = false
      + id           = (known after apply)
      + key          = "AWS_SECRET_ACCESS_KEY"
      + sensitive    = true
      + value        = (sensitive value)
      + workspace_id = (known after apply)
    }

  # module.common_resources.module.organization.tfe_variable.organization_api_cockroach_api_key will be created
  + resource "tfe_variable" "organization_api_cockroach_api_key" {
      + category     = "env"
      + hcl          = false
      + id           = (known after apply)
      + key          = "COCKROACH_API_KEY"
      + sensitive    = true
      + value        = (sensitive value)
      + workspace_id = (known after apply)
    }

  # module.common_resources.module.organization.tfe_variable.organization_api_upstash_api_key will be created
  + resource "tfe_variable" "organization_api_upstash_api_key" {
      + category     = "env"
      + hcl          = false
      + id           = (known after apply)
      + key          = "TF_VAR_UPSTASH_API_KEY"
      + sensitive    = true
      + value        = (sensitive value)
      + workspace_id = (known after apply)
    }

  # module.common_resources.module.organization.tfe_variable.organization_aws_access_key_id will be created
  + resource "tfe_variable" "organization_aws_access_key_id" {
      + category     = "env"
      + hcl          = false
      + id           = (known after apply)
      + key          = "AWS_ACCESS_KEY_ID"
      + sensitive    = true
      + value        = (sensitive value)
      + workspace_id = (known after apply)
    }

  # module.common_resources.module.organization.tfe_variable.organization_aws_secret_access_key will be created
  + resource "tfe_variable" "organization_aws_secret_access_key" {
      + category     = "env"
      + hcl          = false
      + id           = (known after apply)
      + key          = "AWS_SECRET_ACCESS_KEY"
      + sensitive    = true
      + value        = (sensitive value)
      + workspace_id = (known after apply)
    }

  # module.common_resources.module.organization.tfe_variable.organization_cockroach_api_key will be created
  + resource "tfe_variable" "organization_cockroach_api_key" {
      + category     = "env"
      + hcl          = false
      + id           = (known after apply)
      + key          = "COCKROACH_API_KEY"
      + sensitive    = true
      + value        = (sensitive value)
      + workspace_id = (known after apply)
    }

  # module.common_resources.module.organization.tfe_variable.organization_upstash_api_key will be created
  + resource "tfe_variable" "organization_upstash_api_key" {
      + category     = "env"
      + hcl          = false
      + id           = (known after apply)
      + key          = "TF_VAR_UPSTASH_API_KEY"
      + sensitive    = true
      + value        = (sensitive value)
      + workspace_id = (known after apply)
    }

  # module.common_resources.module.organization.tfe_workspace.organization will be created
  + resource "tfe_workspace" "organization" {
      + allow_destroy_plan            = true
      + auto_apply                    = false
      + execution_mode                = "local"
      + file_triggers_enabled         = true
      + force_delete                  = true
      + global_remote_state           = (known after apply)
      + html_url                      = (known after apply)
      + id                            = (known after apply)
      + name                          = "production_organization"
      + operations                    = (known after apply)
      + organization                  = "connectilly"
      + project_id                    = (known after apply)
      + queue_all_runs                = true
      + remote_state_consumer_ids     = (known after apply)
      + resource_count                = (known after apply)
      + speculative_enabled           = true
      + structured_run_output_enabled = true
      + tag_names                     = [
          + "organization",
          + "production",
        ]
      + terraform_version             = (known after apply)
      + working_directory             = "./src/organization/shared/infrastructure/workspaces/production"
    }

  # module.common_resources.module.organization.tfe_workspace.organization_api will be created
  + resource "tfe_workspace" "organization_api" {
      + allow_destroy_plan            = true
      + auto_apply                    = false
      + execution_mode                = "local"
      + file_triggers_enabled         = true
      + force_delete                  = true
      + global_remote_state           = (known after apply)
      + html_url                      = (known after apply)
      + id                            = (known after apply)
      + name                          = "production_organization_api"
      + operations                    = (known after apply)
      + organization                  = "connectilly"
      + project_id                    = (known after apply)
      + queue_all_runs                = true
      + remote_state_consumer_ids     = (known after apply)
      + resource_count                = (known after apply)
      + speculative_enabled           = true
      + structured_run_output_enabled = true
      + tag_names                     = [
          + "api",
          + "organization",
          + "production",
        ]
      + terraform_version             = (known after apply)
      + working_directory             = "./src/organization/organization-api/infrastructure/workspaces/production"
    }

  # module.common_resources.module.shared.tfe_variable.shared_aws_access_key_id will be created
  + resource "tfe_variable" "shared_aws_access_key_id" {
      + category     = "env"
      + hcl          = false
      + id           = (known after apply)
      + key          = "AWS_ACCESS_KEY_ID"
      + sensitive    = true
      + value        = (sensitive value)
      + workspace_id = (known after apply)
    }

  # module.common_resources.module.shared.tfe_variable.shared_aws_secret_access_key will be created
  + resource "tfe_variable" "shared_aws_secret_access_key" {
      + category     = "env"
      + hcl          = false
      + id           = (known after apply)
      + key          = "AWS_SECRET_ACCESS_KEY"
      + sensitive    = true
      + value        = (sensitive value)
      + workspace_id = (known after apply)
    }

  # module.common_resources.module.shared.tfe_variable.shared_cockroach_api_key will be created
  + resource "tfe_variable" "shared_cockroach_api_key" {
      + category     = "env"
      + hcl          = false
      + id           = (known after apply)
      + key          = "COCKROACH_API_KEY"
      + sensitive    = true
      + value        = (sensitive value)
      + workspace_id = (known after apply)
    }

  # module.common_resources.module.shared.tfe_variable.shared_upstash_api_key will be created
  + resource "tfe_variable" "shared_upstash_api_key" {
      + category     = "env"
      + hcl          = false
      + id           = (known after apply)
      + key          = "TF_VAR_UPSTASH_API_KEY"
      + sensitive    = true
      + value        = (sensitive value)
      + workspace_id = (known after apply)
    }

  # module.common_resources.module.shared.tfe_workspace.shared will be created
  + resource "tfe_workspace" "shared" {
      + allow_destroy_plan            = true
      + auto_apply                    = false
      + execution_mode                = "local"
      + file_triggers_enabled         = true
      + force_delete                  = true
      + global_remote_state           = (known after apply)
      + html_url                      = (known after apply)
      + id                            = (known after apply)
      + name                          = "production_shared"
      + operations                    = (known after apply)
      + organization                  = "connectilly"
      + project_id                    = (known after apply)
      + queue_all_runs                = true
      + remote_state_consumer_ids     = (known after apply)
      + resource_count                = (known after apply)
      + speculative_enabled           = true
      + structured_run_output_enabled = true
      + tag_names                     = [
          + "production",
          + "shared",
        ]
      + terraform_version             = (known after apply)
      + working_directory             = "./src/shared/infrastructure/workspaces/production"
    }

Plan: 36 to add, 0 to change, 36 to destroy.

```
</details>
*Pushed by: @mortezaalizadeh, Action: `pull_request`*